In [41]:
from sqlalchemy import create_engine
import pandas as pd
engine = create_engine('sqlite:///country_club2.sqlite')

In [43]:


q10_query = 'SELECT f.name, SUM(CASE WHEN (m.memid = 0) THEN f.guestcost * b.slots ELSE f.membercost * b.slots END) as Revenue FROM Facilities f JOIN Bookings b ON b.facid = f.facid JOIN Members m ON m.memid = b.memid GROUP BY b.facid HAVING Revenue < 1000 ORDER BY Revenue'

df = pd.read_sql_query(q10_query, engine)
print(df)

            name  Revenue
0   Table Tennis      180
1  Snooker Table      240
2     Pool Table      270

In [44]:
q11_query  = "SELECT m.firstname || ' ' || m.surname AS Member, m2.firstname || ' ' || m2.surname as Recommended_By FROM Members m JOIN Members m2 ON m2.memid = m.recommendedby WHERE m.recommendedby > 0 ORDER BY m.surname"
df = pd.read_sql_query(q11_query, engine)
print(df)

                     Member     Recommended_By
0            Florence Bader    Ponder Stibbons
1                Anne Baker    Ponder Stibbons
2             Timothy Baker     Jemima Farrell
3                Tim Boothe         Tim Rownam
4            Gerald Butters       Darren Smith
5               Joan Coplin      Timothy Baker
6             Erica Crumpet        Tracy Smith
7                Nancy Dare    Janice Joplette
8           Matthew Genting     Gerald Butters
9                 John Hunt  Millicent Purview
10              David Jones    Janice Joplette
11            Douglas Jones        David Jones
12          Janice Joplette       Darren Smith
13           Anna Mackenzie       Darren Smith
14             Charles Owen       Darren Smith
15             David Pinker     Jemima Farrell
16        Millicent Purview        Tracy Smith
17         Henrietta Rumney    Matthew Genting
18         Ramnaresh Sarwin     Florence Bader
19               Jack Smith       Darren Smith
20          Ponder Stibbons       Burton Tracy
21  Henry Worthington-Smyth        Tracy Smith

In [45]:
q12_query = 'SELECT f.name, COUNT(b.bookid) as Member_Bookings FROM Bookings b JOIN Facilities f ON f.facid = b.facid JOIN Members m ON b.memid = m.memid WHERE b.memid > 0 GROUP by f.facid '
df = pd.read_sql_query(q12_query, engine)
print(df)

              name  Member_Bookings
0   Tennis Court 1              308
1   Tennis Court 2              276
2  Badminton Court              344
3     Table Tennis              385
4   Massage Room 1              421
5   Massage Room 2               27
6     Squash Court              195
7    Snooker Table              421
8       Pool Table              783

In [46]:
q13_query = 'SELECT Month, Count(Month) as Monthly_Usage, Fac_Name FROM (SELECT strftime(\'%m\',b.starttime) as Month, b.facid, f.name as Fac_Name FROM Bookings b JOIN Members m ON b.memid = m.memid JOIN Facilities f ON f.facid = b.facid WHERE b.memid > 0 AND strftime(\'%m\',b.starttime) = \'08\') As sub GROUP BY Fac_Name UNION SELECT Month, Count(Month) as Monthly_Usage, Fac_Name FROM (SELECT strftime(\'%m\',b.starttime) as Month, b.facid, f.name as Fac_Name FROM Bookings b JOIN Members m ON b.memid = m.memid JOIN Facilities f ON f.facid = b.facid WHERE b.memid > 0 AND strftime(\'%m\',b.starttime) = \'09\') As sub GROUP BY Fac_Name UNION SELECT Month, Count(Month) as Monthly_Usage, Fac_Name FROM (SELECT strftime(\'%m\',b.starttime) as Month, b.facid, f.name as Fac_Name FROM Bookings b JOIN Members m ON b.memid = m.memid JOIN Facilities f ON f.facid = b.facid WHERE b.memid > 0 AND strftime(\'%m\',b.starttime) = \'07\') As sub GROUP BY Fac_Name'
df = pd.read_sql_query(q13_query, engine)
print(df)

   Month  Monthly_Usage         Fac_Name
0     07              4   Massage Room 2
1     07             23     Squash Court
2     07             41   Tennis Court 2
3     07             48     Table Tennis
4     07             51  Badminton Court
5     07             65   Tennis Court 1
6     07             68    Snooker Table
7     07             77   Massage Room 1
8     07            103       Pool Table
9     08              9   Massage Room 2
10    08             85     Squash Court
11    08            109   Tennis Court 2
12    08            111   Tennis Court 1
13    08            132  Badminton Court
14    08            143     Table Tennis
15    08            153   Massage Room 1
16    08            154    Snooker Table
17    08            272       Pool Table
18    09             14   Massage Room 2
19    09             87     Squash Court
20    09            126   Tennis Court 2
21    09            132   Tennis Court 1
22    09            161  Badminton Court
23    09            191   Massage Room 1
24    09            194     Table Tennis
25    09            199    Snooker Table
26    09            408       Pool Table